/*
?Напишите генератор паззлов, в котором на входе вы задаете последовательность слов, которые накладываются друг на друга последний буквой идущего первым слова и первой буквой следующего слова таким образом, чтобы можно было наблюдать схожесть/расхождение этих букв. На выходе необходимо записать N-ное слово, в котором последняя/первая буква совпадает/расходится.

*/

/*
import nightsky::puzzle::Puzzle;
import nightsky::puzzle::PuzzleImage;
import nightsky::puzzle::Reveal;
import nightsky::puzzle::RevealPrecise;
import nightsky::canvas::Canvas;
import nightsky::canvas::Point2D;
import nightsky::canvas::Color;
import nightsky::canvas::TextAlign;
import nightsky::canvas::TextAlignLeft;
import nightsky::canvas::TextAlignRight;
import nightsky::canvas::TextAlignCenter;
import std::math::Math;
import std::collections::List;
import std::collections::ListSort;
import std::string::String;
import community::near::spensa2::plural::PluralRu;

class Main {
    function gen_puzzle() -> Puzzle {
        let word = [
            "абажур", "абажуры", "абаз", "абак", "абака", "аббат", "аббатство", "аббревиатура",
            "выпуск", "выручка", "выставка", "выход", "гадание", "гаджет", "газета", "галерея", 
            "гармония", "гарантия", "гарнизон", "гастрономия", "география", "герой", "гимнастика", 
            "гипотеза", "главарь", "глобус", "гном", "гобелен", "государство", "гравировка", 
            "грамматика", "гранат", "грация", "авиаматка", "гроздь", "грузовик", "губернатор", "гудок", 
            "абвер", "абзац", "абонемент", "абонент", "абордаж", "аквалангистка", "аборт", "абракадабра",
            "адиабата", "абсолют", "абстракция", "абсцесс", "абсурд", "авангард", "аванс", "аванпост",
            "авантюра", "авантюризм", "аккомпаниаторша", "август", "авиабаза", "авиабилет", "авиапочта", 
            "авиарейс", "авиастроение", "автобус", "амальгама", "автодорога", "автомат", "автоматика", 
            "автомобилист", "автономия", "автор", "авторадио", "авторитет", "автотранспорт", 
            "агава", "агент", "агитация", "агломерация", "агнец", "агрегат", "агрессия", "агробизнес", 
            "аудиенция", "аудитория", "аура", "афганец", "афера", "афиша", "анаплазма", "ацетон", 
            "африка", "бакалавр", "багаж", "бакенбарды", "балалайка", "балет", "балкон", "баланс", 
            "банан", "банк", "банкир", "банкомат", "анафаза", "банкротство", "баня", "баржа", "абракадабра", 
            "барьер", "баскетбол", "батарея", "бахрома", "баянист", "бегемот", "бензин", "береза", 
            "беседа", "библиотека", "анаграмма", "биржа", "благодарность", "бланк", "аванкамера", 
            "авторадиограмма", "бобр", "богатырь", "богиня", "богородица", "богослужение", "бодрость", 
            "бокал", "боксер", "болезнь", "боль", "борьба", "ботинок", "аппаратура", "братство", 
            "бревно", "бригадир", "бриллиант", "брошюра", "аппаратчица", "бублик", "будущее", "булавка", 
            "агропропаганда", "буклет", "булка", "буржуазия", "буфет", "бухгалтерия", "быстрота", "бюджет", 
            "вагон", "валюта", "вандализм", "варвар", "варенье", "вафля", "вахта", "ведро", "веер", 
            "вектор", "великан", "венгрия", "вентиляция", "версия", "вертолет", "ветер", "ветеринар", 
            "взгляд", "взломщик", "анабаптистка", "вода", "воздействие", "возмездие", "волк", "авиабаза", 
            "авиатрасса", "вопль", "воронка", "восклицание", "астраханка", "впечатление", "враг", 
            "азербайджанка", "агроэкология", "адвокат", "администрация", "адмирал", "административный", 
            "азарт", "азбука", "азия", "академия", "акация", "аквариум", "аккумулятор", "аккорд", 
            "аккуратность", "акробат", "акробатика", "аксельбант", "акселерация", "аксиома", 
            "активация", "актив", "активист", "активность", "актуальность", "акула", "алгоритм", 
            "алебарда", "алебастр", "александр", "александра", "александрович", "алиби", "алкоголь", 
            "аллея", "аллигатор", "алмаз", "алхимия", "алфавит", "альбатрос", "альбом", "альтернатива", 
            "альтруизм", "аляска", "амазонка", "амбразура", "амбиция", "америка", "амнистия", "аморальность", 
            "ампула", "амфибия", "анализ", "аналог", "ананас", "анатомия", "ангел", "анекдот", 
            "анемия", "аниматор", "анонс", "анормальность", "антарктида", "антенна", "антология", 
            "антураж", "анфилада", "анютины", "аншлаг", "апатия", "апелляция", "апельсин", "аппарат", 
            "аппетит", "апрель", "арабика", "аранжировка", "арбат", "арбитраж", "аргумент", "ареал", 
            "арена", "аристократ", "аристократия", "армия", "аромат", "артиллерия", "арфист", 
            "архив", "архитектура", "архипелаг", "арьергард", "аспект", "ассортимент", "астрология", 
            "астронавт", "астрономия", "атаковала", "атлант", "атмосфера", "атмосферность", "атрибут", 
            "врата", "время", "вселенная", "встреча", "выгода", "выдача", "выдумка", "выживание", 
            "авиаразведка", "гуманитарий", "авиаразведка"
        ];
        
        for (let i in 0..20) {
            word = community::near::dtalalaev::shuffleStringArray::Main::shuffle(word);
        }
        
        word = word[0..Main::getRandomIntInRange(3, 5)];
        let canvas = Canvas::create(2500, 30, Color::rgb(255, 255, 255));
        
        let offsetX = 0;

        for (let i in 0..word.length()) {
            let letters = word[i].split("");
            for (let j in 0..letters.length()) {
                let letter = letters[j];
                if (letter != "") {
                    Canvas::text(canvas, offsetX, 25, letter, 18, new TextAlignLeft{} as TextAlign, Color::rgb(0, 0, 0));
                    if (j != letters.length()-1) {
                        offsetX += 12;
                    } else {
                        offsetX += 5;
                    }
                }
            }
        }
        
        let pos = ["последняя", "первая"][Main::getRandomIntInRange(0, 1)]
        let condition = ["совпадает", "расходится"][Main::getRandomIntInRange(0, 1)];

        let result = "Такого слова нет";

        for (let i in 1..word.length()) {
            let first = word[i-1].split("")[word[i-1].split("").length()-1];
            let last = word[i].split("")[1];
            
            if (condition == "совпадает" && pos == "последняя") {                
                if (first == last) {result = word[i-1]; break;}
            } else if (condition == "совпадает" && pos == "первая") {
                if (first == last) {result = word[i]; break;}
            } else if (condition == "расходится" && pos == "последняя") {
                if (first != last) {result = word[i-1]; break;}
            } else if (condition == "расходится" && pos == "первая") {
                if (first != last) {result = word[i]; break;}
            }
        }
        
        let name = "Инна|Аня|Алина|Оля|Катя|Полина|Арина|Вера|Надя|Соня|Бьянка|Василиса|Ванесса|Вероника|Жанна".split("|")[Main::getRandomIntInRange(0, 14)];
        let wher = "в школе|на факультативе|у репетитора|на олимпиаде".split("|")[Main::getRandomIntInRange(0, 3)];
        let what = "задачу|задачу на внимательность|упражнение|тест, в котором есть задача|дополнительное задание|задание".split("|")[Main::getRandomIntInRange(0, 5)];
        let task = "отмечена|показана|выставлена|указана|видна".split("|")[Main::getRandomIntInRange(0, 4)];
        let whatDo = "вычислить|понять|выяснить|определить|найти".split("|")[Main::getRandomIntInRange(0, 4)];

        let conditions = [
            "которые накладываются друг на друга последней буквой идущего первым слова и первой буквой следующего слова", 
            "где начало каждого слово накладывается на предыдущие начала слово",
            "в котором слова накладываются друг на друга первой и последней буквой",
            "где начало каждого слово накладываются друг на друга последней буквой идущего слова на первую букву",
            "которое накладывается первой и последней буквой в слове"
        ][Main::getRandomIntInRange(0, 4)];

        let sc = name + " получила " + wher + " " + what + ". "
            + " На листике " + task + " последовательность слов, " + conditions + ": \n<img canvas>"
            + "\nЕё попросили " + whatDo + " слово, в котором " + pos + " буква " + condition + " с другой накладываемой буквой.";

        if(Main::getRandomIntInRange(0, 1) == 1) {
            sc = "Дана последовательность слов, " + conditions + ": \n<img canvas>"
                + "Требуется определить слово, в котором " + pos + " буква " + condition + " с другой накладываемой буквой.";
        }

        let desc = sc + " Если такого слова нет, в ответ записать \"Такого слова нет\"."
            + "\n Пример вывода, следующий: \"астрономия\""
            + "\n<reveal ans>Ответ</reveal>";

        let expl = "Сначала выясним какие снава представлены в последовательности: " + String::join(word, ", ") + ".\n Теперь просмотрим каждые слова накладываемые друг на друга пока не найдём слово подходящее по условиям: \n";

        for (let i in 1..word.length()) {
            let first = word[i-1].split("")[word[i-1].split("").length()-1];
            let last = word[i].split("")[1];
            
            expl += word[i-1] + " и " + word[i]
                + "\n Последняя буква первого слова: " + first + ", первая буква второго слова " + last + ".\n";
            
            if (condition == "совпадает" && pos == "последняя") {    
                if (first == last) {expl += "Последняя буква совпадает с первой, значит ответ: " + word[i-1]; break}
                else {expl += "Ни одно из этих слов не подходит.\n\n"}
            } else if (condition == "совпадает" && pos == "первая") {
                if (first == last) {expl += "Первая буква совпадает с последней, значит ответ: " + word[i]; break}
                else {expl += "Ни одно из этих слов не подходит.\n\n"}
            } else if (condition == "расходится" && pos == "последняя") {
                if (first != last) {expl += "Последняя буква расходится с первой, значит ответ: " + word[i-1]; break}
                else {expl += "Ни одно из этих слов не подходит.\n\n"}
            } else if (condition == "расходится" && pos == "первая") {
                if (first != last) {expl += "Первая буква расходится с последней, значит ответ: " + word[i]; break}
                else {expl += "Ни одно из этих слов не подходит.\n\n"}
            }
        }
        
        if (result == "Такого слова нет") {
            expl += "\n Т.к. нет ни одного нужного слова, ответом будет: " + result
        }

        return new Puzzle {
            question: desc,
            solution: expl,
            images: [
                new PuzzleImage {
                    name: "canvas",
                    image: canvas
                }
            ],
            reveals: [
                new RevealPrecise {
                    name: "ans",
                    answer: result
                } as Reveal
            ],
        }
    }

    function getRandomIntInRange(a: int, b: int) -> int {
        return (Math::random() * (b - a + 1) as float + a as float) as int;
    }
}
*/