/*
* Honeypot_1: только 4 вариации + 8 кубиков никогда не выпадают
* Honeypot_2: в условиях требуется округлить до десятитысячных (0.123), окгуляю до десятых (0.1)
* Honeypot_3: правильный расчёт 762/32*10, считается как 762/(32*10)
* Honeypot_4: неправильные ответы, просто рандомный ответ из массива
* Honeypot_5: ответ всегда уменьшен на 1, не доходит до монеты
* Honeypot_6: ответ в reveal больше от 1 до 10
* Honeypot_7: К примеру (не используйте его). А он использован ...(*￣０￣)ノ
* Honeypot_8: В условии говориться что считаем по модулю, но в задании не используется
* Honeypot_9: Нет Reveals
* Honeypot_10: в ответ нужно записать сокращённую дробь, записана не сокращённая
* Honeypot_11: Нет Reveals
* Honeypot_12: 1 вариация условия
* Honeypot_13: 2 вариации условия
* Honeypot_14: нет explain
* Honeypot_15: нет explain и ans.length() + 1
* Honeypot_16: нет explain
* Honeypot_17: рыбий текст
* Honeypot_18: нет explain
* Honeypot_19: нет explain
* Honeypot_20: нет explain
*/