/*
?Создайте генератор, который будет выводить случайное количество слов от 2 до 7. Человеку нужно будет записать в ответ количество слов, которые имеют более 3-х гласных букв, в которых будет встречаться буква «А».

*/

/*
import nightsky::puzzle::Puzzle;
import nightsky::puzzle::PuzzleImage;
import nightsky::puzzle::Reveal;
import nightsky::puzzle::RevealPrecise;
import nightsky::canvas::Canvas;
import nightsky::canvas::Point2D;
import nightsky::canvas::Color;
import nightsky::canvas::TextAlign;
import nightsky::canvas::TextAlignLeft;
import nightsky::canvas::TextAlignRight;
import nightsky::canvas::TextAlignCenter;
import std::math::Math;
import std::collections::List;
import std::collections::ListSort;
import std::string::String;

class Main {
    function gen_puzzle() -> Puzzle {
        let words = [
            "абажур", "абажуры", "абаз", "абак", "абака", "аббат", "аббатство", "аббревиатура",
            "выпуск", "выручка", "выставка", "выход", "гадание", "гаджет", "газета", "галерея", 
            "гармония", "гарантия", "гарнизон", "гастрономия", "география", "герой", "гимнастика", 
            "гипотеза", "главарь", "глобус", "гном", "гобелен", "государство", "гравировка", 
            "грамматика", "гранат", "грация", "авиаматка", "гроздь", "грузовик", "губернатор", "гудок", 
            "абвер", "абзац", "абонемент", "абонент", "абордаж", "аквалангистка", "аборт", "абракадабра",
            "адиабата", "абсолют", "абстракция", "абсцесс", "абсурд", "авангард", "аванс", "аванпост",
            "авантюра", "авантюризм", "аккомпаниаторша", "август", "авиабаза", "авиабилет", "авиапочта", 
            "авиарейс", "авиастроение", "автобус", "амальгама", "автодорога", "автомат", "автоматика", 
            "автомобилист", "автономия", "автор", "авторадио", "авторитет", "автотранспорт", 
            "агава", "агент", "агитация", "агломерация", "агнец", "агрегат", "агрессия", "агробизнес", 
            "аудиенция", "аудитория", "аура", "афганец", "афера", "афиша", "анаплазма", "ацетон", 
            "африка", "бакалавр", "багаж", "бакенбарды", "балалайка", "балет", "балкон", "баланс", 
            "банан", "банк", "банкир", "банкомат", "анафаза", "банкротство", "баня", "баржа", "абракадабра", 
            "барьер", "баскетбол", "батарея", "бахрома", "баянист", "бегемот", "бензин", "береза", 
            "беседа", "библиотека", "анаграмма", "биржа", "благодарность", "бланк", "аванкамера", 
            "авторадиограмма", "бобр", "богатырь", "богиня", "богородица", "богослужение", "бодрость", 
            "бокал", "боксер", "болезнь", "боль", "борьба", "ботинок", "аппаратура", "братство", 
            "бревно", "бригадир", "бриллиант", "брошюра", "аппаратчица", "бублик", "будущее", "булавка", 
            "агропропаганда", "буклет", "булка", "буржуазия", "буфет", "бухгалтерия", "быстрота", "бюджет", 
            "вагон", "валюта", "вандализм", "варвар", "варенье", "вафля", "вахта", "ведро", "веер", 
            "вектор", "великан", "венгрия", "вентиляция", "версия", "вертолет", "ветер", "ветеринар", 
            "взгляд", "взломщик", "анабаптистка", "вода", "воздействие", "возмездие", "волк", "авиабаза", 
            "авиатрасса", "вопль", "воронка", "восклицание", "астраханка", "впечатление", "враг", 
            "азербайджанка", "агроэкология", "адвокат", "администрация", "адмирал", "административный", 
            "азарт", "азбука", "азия", "академия", "акация", "аквариум", "аккумулятор", "аккорд", 
            "аккуратность", "акробат", "акробатика", "аксельбант", "акселерация", "аксиома", 
            "активация", "актив", "активист", "активность", "актуальность", "акула", "алгоритм", 
            "алебарда", "алебастр", "александр", "александра", "александрович", "алиби", "алкоголь", 
            "аллея", "аллигатор", "алмаз", "алхимия", "алфавит", "альбатрос", "альбом", "альтернатива", 
            "альтруизм", "аляска", "амазонка", "амбразура", "амбиция", "америка", "амнистия", "аморальность", 
            "ампула", "амфибия", "анализ", "аналог", "ананас", "анатомия", "ангел", "анекдот", 
            "анемия", "аниматор", "анонс", "анормальность", "антарктида", "антенна", "антология", 
            "антураж", "анфилада", "анютины", "аншлаг", "апатия", "апелляция", "апельсин", "аппарат", 
            "аппетит", "апрель", "арабика", "аранжировка", "арбат", "арбитраж", "аргумент", "ареал", 
            "арена", "аристократ", "аристократия", "армия", "аромат", "артиллерия", "арфист", 
            "архив", "архитектура", "архипелаг", "арьергард", "аспект", "ассортимент", "астрология", 
            "астронавт", "астрономия", "атаковала", "атлант", "атмосфера", "атмосферность", "атрибут", 
            "врата", "время", "вселенная", "встреча", "выгода", "выдача", "выдумка", "выживание", 
            "авиаразведка", "гуманитарий", "авиаразведка"
        ];
        
        for (let i in 0..Main::getRandomIntInRange(100, 200)) {
            words = Main::shuffleArray(words);
        }
        let words = words[0..Main::getRandomIntInRange(2, 7)];
        let ans = Main::countWords(words);
        
        let name = "Инна|Аня|Алина|Оля|Катя|Полина|Арина|Вера|Надя|Соня|Бьянка|Василиса|Ванесса|Вероника|Жанна".split("|")[Main::getRandomIntInRange(0, 14)];
        let wher = "в школе|на факультативе|у репетитора|на олимпиаде".split("|")[Main::getRandomIntInRange(0, 3)]
        let what = "задачу|задачу на внимательность|упражнение|тест, в котором есть задача|дополнительное задание|задание".split("|")[Main::getRandomIntInRange(0, 5)]
        let task = "отмечен|показан|выставлен|указан|виден".split("|")[Main::getRandomIntInRange(0, 4)];
        let whatDo = "вычислить|понять|выяснить|определить|найти".split("|")[Main::getRandomIntInRange(0, 4)];

        let conditions = [
            "и записать в ответ количество слов, которые имеют более 3-х гласных букв, в которых будет встречаться буква «а»",
            "и указать количество слов, в которых больше 3-х гласных букв, и встречается буква «а»",
            "и записать количество слов, содержащих более 3-х гласных и содержащих букву «а»",
            "и в ответ указать количество слов с более чем 3-мя гласными, в которых присутствует буква «а»",
            "и записать число слов, в которых больше 3-х гласных и есть буква «а»",
            "и определить количество слов, в которых больше 3-х гласных и встречается буква «а»",
            "и в ответ внести количество слов, содержащих более 3-х гласных и букву «а»",
            "и записать количество слов, в которых более 3-х гласных и присутствует буква «а»",
            "и указать количество слов, в которых более 3-х гласных и встречается буква «а»",
            "и записать количество слов с 3-мя и более гласными, в которых есть буква «а»",
            "и посчитать количество слов, имеющих больше 3-х гласных и содержащих букву «а»"
        ][Main::getRandomIntInRange(0, 10)];

        let sc = name + " получила " + wher + " " + what + ". "
            + " На листике " + task + " ряд слов: "
        for (let i in 0..words.length()) {
            sc += words[i] + ", "
        }
        sc = sc[0..sc.length() - 2] + ". Её попросили " + whatDo + " " + conditions
            + ". ";

        if(Main::getRandomIntInRange(0, 1) == 1) {
            sc = "Дан ряд слов: "
            for (let i in 0..words.length()) {
                sc += words[i] + ", "
            }
            sc = sc[0..sc.length() - 2] + ". Требуется определить " + conditions
                + ". ";
        }

        let desc = sc
            + "\n Пример вывода, следующий: \"2\""
            + "\n<reveal ans>Ответ</reveal>";

        let expl = "Будем считать сколько гласных в каждом слове и есть ли буква «а» в нём: \n";
        for (let i in 0..words.length()) {
            expl += words[i] + " - ";
            
              let vowels = "аеёиоуыэюя";

                let vowelCount = 0;
                let hasA = false;

                for (let letter in 1..words[i].split("").length()) {
                  for (let vowel in 0..vowels.split("").length()) {
                    if (words[i].split("")[letter] == vowels.split("")[vowel]) {
                      vowelCount += 1;
                      break;
                    }
                  }

                  if (words[i].split("")[letter] == "а") {
                    hasA = true;
                  }
                }
            
            expl += String::from_int(vowelCount) + " " + Main::declOfNum(vowelCount, ["буква", "буквы", "букв"]) 
                + if (hasA) {" и содержит букву «а»."} else {" и не содержит букву «а»."} + "\n"
        }
        
        expl += "\nСледовательно ответ: " + String::from_int(ans);

        return new Puzzle {
            question: desc,
            solution: expl,
            images: [],
            reveals: [
                new RevealPrecise {
                    name: "ans",
                    answer: String::from_int(ans)
                } as Reveal
            ],
        }
    }

    function declOfNum(n: int, text_forms: List<String>) -> String {  
        n = n % 100; 

        let n1 = n % 10;

        if (n > 10 && n < 20) { return text_forms[2]; }
        if (n1 > 1 && n1 < 5) { return text_forms[1]; }
        if (n1 == 1) { return text_forms[0]; }

        return text_forms[2];
    }
    
    function shuffleArray(array: List<String>) -> List<String> {
        for (let i in 1..array.length()) {
            let j = Main::getRandomIntInRange(i-1, i);
            let temp = array[i];
            array[i] = array[j];
            array[j] = temp;
        }

        return array;
    }
    
    function getRandomIntInRange(a: int, b: int) -> int {
        return (Math::random() * (b - a + 1) as float + a as float) as int;
    }
    
    function countWords(words: List<String>) -> int {
      let count = 0;
      let vowels = "аеёиоуыэюя";

      for (let word in 0..words.length()) {
        let vowelCount = 0;
        let hasA = false;

        for (let letter in 1..words[word].split("").length()) {
          for (let vowel in 0..vowels.split("").length()) {
            if (words[word].split("")[letter] == vowels.split("")[vowel]) {
              vowelCount += 1;
              break;
            }
          }

          if (words[word].split("")[letter] == "а") {
            hasA = true;
          }
        }

        if (vowelCount > 3 && hasA) {
          count += 1;
        }
      }

      return count;
    }
}
*/